[
    {
        "section_number": "SECTION 01",
        "section_name": "PLAYING AREA",
        "section_rules": [
            {
                "page": 17,
                "rule_number": 1,
                "rule_name": "RINK",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 17,
                        "subrule_number": "1.1.",
                        "subrule_name": "RINK",
                        "rule_text": "Games under jurisdiction of the IIHF shall be played on an ice surface known as the “Rink” and must adhere to the dimensions and specifications prescribed by the IIHF and these rules. No ice markings shall be permitted except those provided for under these rules unless express written permission has been obtained from the IIHF. On-ice logos must not interfere with any official ice markings provided for the proper playing of the game. In the interval between periods, the ice surface shall be flooded unless mutually agreed to the contrary.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 17,
                        "subrule_number": "1.2.",
                        "subrule_name": "DIMENSIONS",
                        "rule_text": "The official size of the Rink shall be 60 m long and 26 m to 30 m wide. The corners shall be rounded in the arc of a circle with a radius of 7.0 m to 8.50 m. Any deviations from these dimensions for any IIHF competition require IIHF approval.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 17,
                        "subrule_number": "1.3.",
                        "subrule_name": "BOARDS AND PROTECTIVE GLASS",
                        "rule_text": "The Rink shall be surrounded by a wall known as the “Boards”. The ideal height of the boards above the ice surface shall be 1.07 m. Except for the official markings provided for in these rules, the entire playing surface and the Boards shall be white in color except the “Kick Plate” at the bottom of the Boards, which shall be light yellow in color. Any variations from any of the foregoing dimensions shall require official authorization by the IIHF. The Boards shall be constructed in such a manner that the surface facing the ice shall be smooth and free of any obstruction or any object that could cause injury to Players. Affixed to the Boards and extending vertically shall be an approved “Protective Glass” construction which allow the sections to be flexible. The height above the Boards behind the Goals must be 2.4 m and must extend at least 4.0 m from the “Goal Line” towards the Blue Line. The height above the Boards along the sides must be 1.8 m, except in front of the Players’ Benches. Protective Glass shall be required in front of the Penalty Boxes. The Protective Glass and gear to hold them in position shall be properly padded or protected and mounted on the Boards on the side away from the playing surface including the “Protective Netting” outlined in:",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 18,
                        "subrule_number": "1.4.",
                        "subrule_name": "PROTECTIVE NETTING",
                        "rule_text": "Protective Netting shall be hung in the ends of the Arena, of a height, type, and in a manner approved by the IIHF. The Protective Netting must be suspended above the “End-zone” Protective Glass behind both Goals and must extend around the Rink at least to where the Goal Line meets the Boards. The Protective Netting is to be installed in such a way that it protects the top bench row viewer. Thus, the height of the Protective Netting is determined by the height of the Rink and the settings of the top row of benches.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 19,
                        "subrule_number": "1.5.",
                        "subrule_name": "LINES",
                        "rule_text": "Goal Lines: A red line, 5 cm wide, shall be drawn across the entire width of the ice surface, 4.0 m from each end of the ice surface and continued vertically along the side of the Boards. This line shall be referred to as the \"Goal Line\". The Goal posts and nets shall be set in such a manner as to remain stationary during the process of the game. Goal Crease: In front of each Goal, an area shall be marked by a red line 5 cm wide, named as the “Goal Crease”. Blue Lines: The ice surface between the Goals shall be divided into three (3) zones by lines, 30 cm in width, and blue in color, and extended completely across the Rink, parallel with the Goal Lines, and continued vertically up the side of the Boards, named as the “Blue Lines”. In case advertising is allowed on the Boards, the lines must be marked at least on the Kick Plate. Center Line: Another line, 30 cm in width and red in color, drawn completely across the Rink on center ice, parallel with the Goal Lines and con- tinued vertically up the side of the Boards, named as the “Center Line”. In case advertising is allowed on the Boards, the lines must be marked at least on the Kick Plate.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 19,
                        "subrule_number": "1.6.",
                        "subrule_name": "DIVISION OF ICE SURFACE",
                        "rule_text": "Defending Zone: The portion of the ice surface in which the Goal is situated shall be called the “Defending Zone” of the Team defending that goal. Neutral Zone: The central portion shall be known as the “Neutral Zone”. Attacking Zone: The portion farthest from the defended Goal shall be the “Attacking Zone”.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 20,
                        "subrule_number": "1.7.",
                        "subrule_name": "GOAL CREASE / ON-ICE OFFICIALS’ CREASE",
                        "rule_text": "Goal Crease (markings on the ice surface): Goal Crease Area/ Space: The Goal Crease Area includes all of the space outlined by the crease lines and extends vertically until the top of the crossbar. On-ice Official Crease: In front of the Official Scorekeepers’ Box, a semi-circular area is marked on the ice surface, called the \"On-ice Officials Crease\". A 5 cm wide red line with a radius of 3.0 m marks this crease area.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 20,
                        "subrule_number": "1.8.",
                        "subrule_name": "GOALKEEPER’S RESTRICTED AREA",
                        "rule_text": "Behind each goal, a trapezoidal area is marked on the ice surface, called the \"Goalkeeper Restricted Area\". The two 5 cm wide red lines mark the restricted area between the Goal Line and the Boards behind the Goal. The outside dimension of the marking along the Goal Line is 6.80 m and along the Boards is 8.60 m, and the lines continue vertically on the Kick Plate.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 20,
                        "subrule_number": "1.9.",
                        "subrule_name": "FACE-OFF SPOTS AND CIRCLES",
                        "rule_text": "Face-off Spot and Circle at Center Ice: A circular blue spot, 30 cm in diameter, shall be marked exactly in the center of the Rink. This spot shall be referred to as the “Center Ice Face-off Spot”. With this spot as a center, a circle of 4.50 m radius shall be marked with a blue line 5 cm wide. Face-off Spots in the Neutral Zone: Two (2) red spots, 60 cm in diameter, shall be marked on the ice in the Neutral Zone 1.50 m from each Blue Line. These four (4) spots shall be referred to as the “Neutral-zone Face-off Spots”. Within the Face-off Spot, draw two parallel lines 8 cm from the top and bottom of the spot. The area within the two lines shall be painted red, the remainder shall be painted white. The spots shall be 14.0 m apart and each shall be a uniform distance from the adjacent Boards. Face-off Spots and Circles in the End-Zones (Attacking and Defending Zone): In both End-zones and on both sides of each goal, red Face-off Spots and circles shall be marked on the ice. The Face-off Spots shall be 60 cm in diameter. These four (4) spots shall be referred to as the “End-zone Face-off Spots”. Within the Face-off Spot, draw two parallel lines 8 cm from the top and bottom of the spot. The area within the two lines shall be painted red, the remainder shall be painted white. The circles shall be marked with a red line 5 cm wide with a radius of 4.50 m from the center of the Face-off Spots. At the outer edge of both sides of each Face-off Circle and parallel to the “Goal Line”, two red lines 5 cm wide and 60 cm in length and 1.70 m apart shall be marked. 30 cm away from the outer edge of the Face-off Spot, two red lines 5 cm wide shall be drawn parallel with the Side Boards that shall be 1.20 m in length and 45 cm apart. Parallel to the End Boards, commencing at the end of the line nearest to the Face-off Spot, a red line 5 cm wide shall extend 90 cm in length.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 21,
                        "subrule_number": "1.10.",
                        "subrule_name": "ICE CLEANING",
                        "rule_text": "Aside from the normal ice resurfacing that is performed during the intermissions between each period of play. If applicable, additional snow removal activities shall be performed.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 21,
                "rule_number": 2,
                "rule_name": "GOAL POSTS AND NETS",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 21,
                        "subrule_number": "2.1.",
                        "subrule_name": "GOAL POSTS",
                        "rule_text": "Each Rink must have two (2) “Goal Nets”, one at either end of the Rink. The “Goal Net” is comprised of a Goal frame and netting. The open end of the goal net must face Center ice. Each Goal Net must be located in the center of the Goal Line at either end and must be installed in such manner as to remain stationary during the progress of the game. The Goal posts must be kept in position by means of flexible pegs affixed in the ice or floor, but which displace the Goal Net from its moorings upon significant contact. The holes for the goal pegs must be located exactly on the Goal Line. The Goal posts shall be of an approved design and material, extending vertically 1.22 m above the surface of the ice and set 1.83 m apart measured from the inside of the posts. A crossbar of the same material as the Goal posts shall extend from the top of one post to the top of the other. The Goal posts and crossbar shall be painted in red color and all other exterior surfaces shall be painted in white color.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 22,
                        "subrule_number": "2.2.",
                        "subrule_name": "GOAL NETS",
                        "rule_text": "A net of an approved design shall be attached to each Goal frame and made of white nylon cord, which shall be draped in such a manner as to prevent the puck coming to rest on the outside of it yet strung in a manner that will keep the puck in the net. A skirt of heavy white nylon fabric or heavyweight white canvas shall be laced around the base plate of the goal frame in such a way as to protect the Goal net from being cut or broken. This protective padding must be attached in a manner that will not restrict the puck from completely crossing the Goal Line. This padding must be set back 15 cm from the inside of the Goal post. This skirt shall not project more than 2.5 cm above the base plate. The frame of the Goal shall be draped with a nylon mesh net to completely enclose the back of the frame.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 22,
                "rule_number": 3,
                "rule_name": "BENCHES",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 22,
                        "subrule_number": "3.1.",
                        "subrule_name": "PLAYERS’ BENCHES",
                        "rule_text": "Each Rink shall be provided with seats or benches for the use by Players of both Teams. Teams must use the same Player’s Bench for the duration of a game. The accommodations provided, including benches and doors, must be uniform for both Teams. The Players’ Benches shall be placed immediately alongside the ice as near to the center of the Rink as possible. Two (2) doors for each Players’ Bench must be uniform in location and size and as conveniently close to the Dressing Rooms as possible. Each Players’ Bench should be 10 m in length and 1.50 m in width and when situated in the spectator area, shall be separated from the spectators by a Protective Glass to afford the necessary protection for the Players and Team Personnel. The Players’ Benches shall be on the same side of the playing surface opposite the Penalty Box and should be separated by a substantial distance, if possible. Note The designated Home Team is entitled to its choice of Players’ Bench if not otherwise defined. At IIHF Championships, the respective Player’s Benches will be assigned to the respective Teams.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 23,
                        "subrule_number": "3.2.",
                        "subrule_name": "PENALTY BOX",
                        "rule_text": "Each Rink must be provided with benches or seats to be known as the “Penalty Box”. Separate Penalty Boxes shall be provided for each Team and they shall be situated on the opposite sides directly across the ice from their Players' Benches. Teams must use the “Penalty Box” opposite their Players’ Bench and must use the same “Penalty Box” for the duration of a game. Each “Penalty Box” should be at least 4.0 m in length and 1.50 m in width and shall be separated from the spectators by a Protective Glass to afford the necessary protection for the Players. Each Penalty Box must be of the same size and quality, offering no advantage to either Team in any manner and must have only one door for both entry and exit and must be operated only by the “Penalty Box Attendant”. Only the Penalty Box Attendant, penalized Skaters, and Game Officials are allowed access to the Penalty Boxes.",
                        "appendix_information": [
                            "VI – Infographics"
                        ],
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 23,
                "rule_number": 4,
                "rule_name": "SIGNAL AND TIMING DEVICES",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 23,
                        "subrule_number": "4.1.",
                        "subrule_name": "SIGNAL DEVICES",
                        "rule_text": "Each Rink must be provided with a suitable sound device that will sound automatically at the conclusion of each period of play. Should the sound device fail to sound automatically when time expires, the determining factor as to whether the period has ended shall be the Game Clock.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 23,
                        "subrule_number": "4.2.",
                        "subrule_name": "TIMING DEVICES",
                        "rule_text": "Each Rink shall be provided with some form of electronic game clock for the purpose of keeping the spectators, Players, Team Personnel and Game Officials accurately informed as to all time elements at all stages of the game including the time remaining to be played in any period and the time remaining to be served by penalized Players on each Team. The game clock is activated by facing-off of the puck by an On-ice Official and shall be stopped by the whistle of an Off-ice Official. Time recording for both game time and penalty time shall show time remaining to be played or served. The Game Time Clock shall measure the time remaining in tenths (1/10) of a second during the last minute of each period.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            }
        ]
    },
    {
        "section_number": "SECTION 02",
        "section_name": "TEAMS",
        "section_rules": [
            {
                "page": 25,
                "rule_number": 5,
                "rule_name": "TEAM",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 25,
                        "subrule_number": "5.1.",
                        "subrule_name": "ELIGIBLE PLAYERS",
                        "rule_text": "A Game is contested between two (2) Teams which play under the direction of On-ice and Off-ice Officials. A Team shall be composed of twenty-two (22) Players. No more than twenty (20) Skaters and two (2) Goalkeepers shall be permit- ted. For the purposes of these playing rules, any reference to “Player” shall refer to both Skaters and Goalkeepers. Any reference to “Goal- keeper” shall mean that the section of the rule is specific to Goalkeepers. Prior to the start of each game, the Team Manager or Coach of each Team shall list on a “Line-up / Roster Sheet” the Players who are eligible to play in the game. For a Team to play a game, it must be able to put on the ice at least five (5) Skaters and one (1) Goalkeeper at the beginning of the game. Only eligible Players can be listed on the Roster Sheet and play in a Game. Players who are registered for a tournament or event but who are not listed on the Official Game Sheet can participate in the pre-game warm-up. The Coach must submit the “Line-up / Roster Sheet” to the Official Scorekeeper at least sixty (60) minutes prior to the start of the game. The Official Game Sheet with the listed names and numbers of all eligible Players must be handed to the On-ice Game Offi- cials before the Game, and no change shall be permitted to the Official Game Sheet after the commencement of the Game. Prior to the Game, if an Official (on-ice or off-ice) notices that a Player is in uniform but has not been included on the Official Game Sheet, the Referee shall bring this to the attention of the offending Team so that the necessary correction can be made to the Official Game Sheet with no penalty assessed. At IIHF Championships, a representative from each Team must confirm the “Line-up / Roster Sheet” at least two (2) minutes prior to the start of the Game, and Players may be added or deleted up to the “opening face-off”. Game rules will not allow for a Team to have more than six (6) Players (one (1) Goalkeeper and five (5) Skaters) on the ice at any time during game action when the team is not penalized. A Team must put at least four (4) Players (one (1) Goalkeeper and three (3) Skaters) on the ice, if two (2) or more Players are pena- lized. A Team must put the required number of players on the ice to resume play.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 74 – Too Many Players on the Ice",
                            "Rule 66 – Forfeit of Game"
                        ]
                    },
                    {
                        "page": 25,
                        "subrule_number": "5.2.",
                        "subrule_name": "INELIGIBLE PLAYER",
                        "rule_text": "Only Players on the Roster Sheet list submitted to the Official Scorekeeper before the game may participate in the Game. The de- termining factor when considering whether a Player is eligible is that the Player’s name, and not necessarily the Player’s number, must be correctly listed by the Team Manager or Coach of that Team. Whenever an ineligible Player is identified to the Referee, the ineligible Player will be removed from the Game and the Team shall not be able to substitute another Player from its Roster. No additional penalties are to be assessed but a report of the incident must be submitted to the Proper Authorities. For an ineligible Goalkeeper see Rule 5.3 – Goalkeeper. If a goal is scored when an ineligible Player is on the ice (whether they were involved in the scoring or not), the goal will be disallowed. This only applies to the goal scored at the stoppage of play whereby the Player was deemed to be ineligible. All other goals scored previously by the ineligible Player’s Team (with them on the ice or not) shall be allowed. If a Player is assessed a penalty, and during the penalty they are found to be an ineligible Player, they will be removed from the game and another Player of their Team, designated by the Coach, must serve the remainder of the penalty. No additional penalties are to be assessed but a report of the incident must be submitted to the Proper Authorities.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 26,
                        "subrule_number": "5.3.",
                        "subrule_name": "GOALKEEPER",
                        "rule_text": "Each Team shall be allowed one (1) Goalkeeper on the ice at one time. The Goalkeeper may be removed and substituted by another Skater. Such substitute shall not be permitted the privileges of the Goalkeeper. Each Team shall have on its Players’ Bench, or on a chair immediately beside the Players’ Bench (or nearby), a substitute Goalkeeper who shall always be fully equipped and ready to play. Each team shall have two (2) Goalkeepers listed on the Official Game Sheet. Exceptions to this rule are permitted in specific IIHF Championships where, only one (1) Goalkeeper, or a third (3rd) listed Goalkeeper is allowed. If the listed (one or two) Goalkeeper/s is/are incapacitated, that Team shall be entitled to dress and play any Goalkeeper who is eligible. In the event that the two (2) regular Goalkeepers are injured or incapacitated in quick succession, the third (3rd) Goal- keeper shall be provided with a reasonable amount of time to get dressed, in addition to a two-minute (2) warm-up (except when they enter the game to defend against a “Penalty Shot”). If, however, the third (3rd) Goalkeeper is dressed and on the Players’ Bench when the second (2nd) Goalkeeper becomes incapacitated, the third (3rd) Goalkeeper shall enter the game immediately and no warm-up is permitted.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 26,
                        "subrule_number": "5.4.",
                        "subrule_name": "COACHES AND TEAM PERSONNEL",
                        "rule_text": "Only Players in uniform and official team personnel duly registered on the Roster Sheet shall be permitted to occupy the Player’s Benches so provided. Every Team must have at least one, and not more than eight (8), Staff Members behind the Team on the Players’ Bench to act as Coach and at least one (1) qualified Coach or Medical Expert to treat Players in case of injury.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 26,
                        "subrule_number": "5.5.",
                        "subrule_name": "TEAM OFFICIALS AND TECHNOLOGY",
                        "rule_text": "Team personnel who are on or near the Players’ Bench during the Game may use radio-technology to contact other Team Personnel in an area designated by the IIHF. Other forms of technology are permitted for Coaching purposes only (e.g., statistics, tagging) and may not be used to attempt to influence the decisions of the On-ice Officials in any way. If the technology is misused, a penalty shall be assessed according to:",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 39 – Abuse of Officials"
                        ]
                    },
                    {
                        "page": 26,
                        "subrule_number": "5.6.",
                        "subrule_name": "PRE-GAME WARM-UP ON THE ICE",
                        "rule_text": "During warm-up on the ice, all protective equipment must be properly worn. Players registered for an IIHF Championship and not listed on the “Line-up / Roster Sheet” may participate in a “pre-game warm-up” on the ice. No Player can warm-up on ice at the end of a period or at any stoppage of play. No penalties are to be assessed but a report of the incident must be submitted to the Proper Authorities.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 27,
                "rule_number": 6,
                "rule_name": "CAPTAIN AND ALTERNATE CAPTAINS",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 27,
                        "subrule_number": "6.1.",
                        "subrule_name": "CAPTAIN",
                        "rule_text": "One (1) Captain shall be appointed by each Team, and they alone shall have the privilege of discussing with the Referees any ques- tions relating to interpretation of rules which may arise during the progress of a Game. The Captain shall wear the letter “C,” approximately 8 cm in height and in contrasting color, in a conspicuous position on the front of their jersey. No “Co-Captains” are permitted. One (1) Captain and no more than two (2) Alternate Captains are permitted – see Rule 6.2 – Alternate Captains. Any Captain, Alternate Captain or any Player who comes off the Players’ Bench and makes any protest or intervention with the Officials for any purpose shall be assessed a Minor Penalty for “Unsportsmanlike Conduct”. Should this protest continue, they may be assessed a Misconduct Penalty, and if it further continues, a Game Misconduct Penalty shall be assessed. A complaint about a penalty is not a matter “relating to the interpretation of the rules” and a Minor Penalty shall be imposed against any Captain, Alternate Captain or any other Player making such a complaint. The Referee and Official Scorekeeper shall be advised, prior to the start of each game, the name of the Captain and the Alternate Captains of both Teams. A team cannot change its Captain or Alternate Captains during a game. If a Captain is ejected from a game or cannot play the entire game because of an injury, one of the Alternate Captains must assume their duties. If both the Captain and Alternate Captain are on the ice, only the Captain is allowed to talk to the Referee about a point of interpre- tation. If either the Captain or the Alternate Captain comes off the Players Bench, uninvited by the Referee, they shall be penalized accordingly. No playing Coach or playing Team Manager or Goalkeeper shall be permitted to act as Captain or Alternate Captain.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 39 – Abuse of Officials"
                        ]
                    },
                    {
                        "page": 27,
                        "subrule_number": "6.2.",
                        "subrule_name": "ALTERNATE CAPTAINS",
                        "rule_text": "If the Captain is not on the ice, an Alternate Captain on the ice shall be accorded the privileges of the Captain. Alternate Captains shall wear the letter “A” approximately 8 cm in height and in contrasting color, in a conspicuous position on the front of their jerseys.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 27,
                "rule_number": 7,
                "rule_name": "STARTING LINE-UP",
                "rule_text": "This rule does not apply at IIHF Championships.",
                "subrules": []
            },
            {
                "page": 28,
                "rule_number": 8,
                "rule_name": "INJURED PLAYERS",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 28,
                        "subrule_number": "8.1.",
                        "subrule_name": "INJURED PLAYER",
                        "rule_text": "When a Player is injured or compelled to leave the ice during a Game, they may retire from the Game and be replaced by a substitute, but play must continue without the Teams leaving the ice. During the play, if an injured Player wishes to retire from the ice and be replaced by a substitute, they must do so at the Players’ Bench and not through any other exit leading from the Rink. This is not a legal Player change and therefore when a violation occurs, a Bench-minor Penalty shall be imposed. If a penalized Player has been injured, they may proceed to the Dressing Room without taking a seat in the Penalty Box. The penali- zed Team shall immediately put a substitute Player in the Penalty Box, who shall serve the penalty until the injured Player is able to return to the game. They would replace their Teammate in the Penalty Box at the next stoppage of play. For violation of this rule, a Bench Minor Penalty shall be imposed. Should the injured penalized Player who has been replaced in the Penalty Box return to their Players’ Bench prior to the expiration of their penalty, they shall not be eligible to play until their penalty has expired. This includes coincidental penalties when their substi- tute is still in the Penalty Box awaiting a stoppage in play. The injured Player must wait until their substitute has been released from the Penalty Box before they are eligible to play. If, however, there is a stoppage of play prior to the expiration of their penalty, they must then replace their Teammate in the Penalty Box and is then eligible to return once their penalty has expired. When a Player is injured so that they cannot continue play or go to their Players’ Bench, the play shall not be stopped until the inju- red Player’s Team has secured control of the puck. If the Player’s Team is in “control of the puck” at the time of injury, play shall be stopped immediately unless their Team is in a scoring position. In the case where it is obvious that a Player has sustained a serious injury, the Referee and/or Linesperson may stop the play imme- diately. Where an injury has occurred to a Player and there is a stoppage of play, a Team Doctor (or other Medical Personnel) may go onto the ice to attend to the injured Player without waiting for the Referee’s consent. When play has been stopped by the Referee or Linesperson due to an injured Player, or whenever an injured Player is attended to on the ice by the Coach or Medical Personnel, such Player must be substituted for immediately. This injured Player cannot return to the ice until play has resumed. When play is stopped for an injured Player, the ensuing “face-off” shall be conducted at the Face-off Spot in the zone nearest the location of the puck when the play was stopped. When the injured Player’s Team has control of the puck in the Attacking Zone, the “face-off” shall be conducted at the nearest Face- off Spot in the Neutral Zone. When the injured Player is in their Defending Zone and the attacking Team is in “possession of the puck” in the Attacking Zone, the “face-off” shall be conducted at the nearest Face-off Spot in the defending Team’s zone. A player who lies on the ice either feigning an injury or refusing to get up off the ice will be issued a Minor Penalty.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 29,
                        "subrule_number": "8.2.",
                        "subrule_name": "INJURED GOALKEEPER",
                        "rule_text": "If a Goalkeeper sustains an injury or becomes ill, they must be ready to resume play immediately or be replaced by a substitute Goalkeeper and no additional time shall be allowed for the purpose of enabling the injured or ill Goalkeeper to resume their position. No warm-up shall be permitted for a substitute Goalkeeper in any game. The substitute Goalkeeper shall be subject to the regular rules governing Goalkeepers and shall be entitled to the same privileges. When a substitution for the injured Goalkeeper has been made, the injured Goalkeeper is not allowed to resume the position until the next stoppage of play. For a violation of the rule, a Minor Penalty for “Delay of Game” shall be assessed. When play has been stopped by the Referee or Linesperson due to an injured Goalkeeper, such Goalkeeper must be substituted for only if they have to proceed to the Players’ Bench to receive medical attention. Where an injury has occurred to a Goalkeeper and there is a stoppage of play, a Team Doctor (or other Medical Personnel) may go onto the ice to attend to the injured Player without waiting for the Referee’s consent. If the Doctor or Medical Personnel has come onto the ice to attend to the Goalkeeper and there is no undue delay, the Goalkeeper may remain in the game. However, no additional time shall be permitted by the Referee for the purpose of enabling the injured Goalkeeper to resume their position (i.e., no warm-up).",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 29,
                        "subrule_number": "8.3.",
                        "subrule_name": "BLOOD",
                        "rule_text": "A Player who is bleeding or who has visible blood on their equipment or body shall be ruled off the ice at the next stoppage of play. Such Player shall not be permitted to return to play until the bleeding has been stopped and the cut or abrasion has been covered (if necessary). It is required that any affected equipment and/or uniform be properly disinfected or exchanged.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            }
        ]
    },
    {
        "section_number": "SECTION 03",
        "section_name": "EQUIPMENT",
        "section_rules": [
            {
                "page": 31,
                "rule_number": 9,
                "rule_name": "UNIFORMS",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 31,
                        "subrule_number": "9.1.",
                        "subrule_name": "TEAM UNIFORM",
                        "rule_text": "All Players of each Team shall be dressed uniformly with an approved design and color of their helmets, jerseys, short pants, and socks. All jerseys of a Team must be of the same design, including logo on the front, numbers on the sleeves and back, and nameplate on the back. The dominant color of the uniform must cover approximately 80 % of the jersey and socks, excluding names and numbers. If, in the opinion of the Referee, the uniform colors of the competing Teams are too similar and there is a possibility of misidentify- ing Players, it is the responsibility of the Home Team to change its jerseys. All Players on a Team must wear the same uniforms and jersey numbers in the on-ice warm-up as during the game. Altered uniforms of any kind, i.e. Velcro inserts, over-sized jerseys, altered collars, etc., will not be permitted. Any Player not complying with this rule shall not be permitted to participate in the game – refer to Rule 9.5. – Protective Equipment. Players are not allowed to change or exchange jersey numbers once the game has started. They must wear the same number for the game’s entirety and throughout entire competition. As an exception to this rule, when a Player’s jersey becomes stained with blood or becomes badly torn during a game, they may be required by an On-ice Official to leave the ice and change into a designated jersey with another number and without a nameplate. Each Team shall design and wear distinctive and contrasting uniforms for their home and away games, no parts of which shall be interchangeable except the pants. Any concerns regarding a Player’s uniform (including the Goalkeeper) shall be reported by the Referee to the Proper Authorities. All Player pants must be worn in a uniform fashion by all Players. The pants must be one consis- tent color around and throughout the leg of the pant. Pant legs are not to be ripped, cut, or torn in the leg / thigh area. Graffiti-type designs, patterns, artwork, drawings, or slogans which are abusive or obscene and refer to culture, race, or religion are not allowed on any part of the uniform.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 31,
                        "subrule_number": "9.2.",
                        "subrule_name": "NUMBERS AND NAMEPLATES",
                        "rule_text": "Each Player listed in the line-up of each Team shall wear an individual identifying number that is 25 – 30 cm high on the back of the jersey and 10 cm high on both sleeves. Numbers are limited to whole numbers from 1 to 99. Jersey numbers such as 00, ½ (fractions), .5 (decimals), 101 (three digit) are not permitted. In addition, each Player shall wear their surname in full, in block letters 10 cm high, across the back of their jersey at shoulder height, in block capital Roman letters of a font approved by the IIHF prior to the game or competition. A Player whose hair is long enough to obscure the nameplate or number on the back of the jersey must fashion it in a ponytail or tuck the hair under the helmet.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 32,
                        "subrule_number": "9.3.",
                        "subrule_name": "SKATER’S JERSEY",
                        "rule_text": "Players who do not comply with these rules are not allowed to participate in the game. Goalkeeper's Jersey- refer to Rule 9.4. Jerseys must not extend lengthwise past the end of the pants, and the sleeves must not extend past the fingers of the glove. No inserts or additions are to be added to the standard Players’ jersey as produced by the manufacturer. Modifications at the manufacturer are not allowed unless approved in advance by the IIHF. Jerseys must be worn completely outside of the pants and must be properly fastened to the pants at all times with tie-down straps. If any Player on that Team fails to comply after a warning, a Minor Penalty will be assessed.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 63 – Delaying the Game"
                        ]
                    },
                    {
                        "page": 32,
                        "subrule_number": "9.4.",
                        "subrule_name": "GOALKEEPER’S JERSEY",
                        "rule_text": "Goalkeepers who do not comply with these rules are not allowed to participate in the game. Jerseys are not to be excessively over- sized. No inserts or additions are to be added to the standard Goalkeeper’s jersey as produced by the manufacturer. Modifications at the manufacturer are not allowed unless approved in advance by the IIHF. No “tying down” of the jersey is allowed at the wrists if it creates a tension across the jersey allowing for a “webbing effect” which is not permitted. No other tie downs are allowed that create a “webbing effect”. The length of a jersey is illegal if it covers any area between the Goalkeeper’s legs.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 32,
                        "subrule_number": "9.5.",
                        "subrule_name": "PROTECTIVE EQUIPMENT",
                        "rule_text": "Equipment must conform to safety standards and be used only to protect Players, not to enhance or improve playing ability or to cause injury to an opponent. All players are strongly recommended to wear cut-resistant socks, sleeves, or undergarments. All protective equipment, except gloves, headgear, mouthguards, neck laceration protector and Goalkeepers’ leg guards must be worn under the uniform. The complete protective equipment must be worn during the game and during “pre-game warm-up”. Should it be brought to the attention of the Referee that a Player is wearing, for example, an elbow pad that is not covered by their jersey, they shall instruct the Player to cover up the pad. A second violation by the same Player would result in a Minor Penalty being assessed. Whenever it is deemed by the Referee that a Player is wearing any equipment that does not meet with the IIHF regulations, they shall instruct the Player to change or remove the piece of equipment. The corresponding Player and their Team will be warned by the Referee to adjust the equipment accordingly. After the warning, all Players on that Team wearing such equipment shall be penalized in accordance with Rule 12 – Illegal Equipment. If the Player refuses, they shall be assessed a Minor Penalty for “Delay of Game” and if they return to the ice without making the change, they shall be issued a Misconduct Penalty. Should this happen a third time, the Player shall be issued a Game Misconduct Penalty.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 32,
                        "subrule_number": "9.6.",
                        "subrule_name": "HELMETS",
                        "rule_text": "All Players shall wear a helmet of design, material and construction approved for ice hockey, with a chin strap always properly fastened, including during “pre-game warm-up”, participating in the game, either on the playing surface or the Players’ Benches or Penalty Boxes. The helmet should be attached in such a way that it cannot fall off. If it falls off and has not been removed by an opponent Player, it has not been attached correctly. A Player on the ice whose helmet comes off during play has to exit the playing surface immediately. A player on the ice whose helmet comes off during play is not allowed to retrieve and put their helmet back on their head – for this they have to proceed to their Players’ Bench and exit the playing surface. If a Player does not comply with this rule, they shall be assessed a Minor Penalty without a warning If the Player returns to their Players’ Bench to be substituted for, they may only return to the ice during play with a helmet (with the chin strap properly fastened). No Player may exit the Penalty Box during play without a helmet (with the chin strap properly fastened). Should they do so, the play shall be stopped once their Team has gained control of the puck and a Minor Penalty shall be assessed to the offending Player. If a Player’s chin strap becomes unfastened during game action, but the helmet stays on their head, they may continue to play until the next stoppage or until they leave the ice. A Player who intentionally removes an opponent’s helmet during play shall be assessed a Minor Penalty for “Roughing”. When a goalkeeper is hit on the face mask by a hard shot with the puck and the Referee believes the Goalkeeper is or may be dazed by that hard shot, the Referee may stop play for safety reasons, if there is no immediate scoring chance for the attacking Team. When a Goalkeeper has lost their helmet and/or face mask and their Team has control of the puck, play shall be stopped immedia- tely to allow the Goalkeeper the opportunity to recollect their helmet and/or face mask. When the opposing Team has control of the puck, play shall only be stopped if there is no immediate and impending scoring oppor- tunity. This stoppage of play must be made by the Referee. When play is stopped because the Goalkeeper has lost their helmet and/ or face mask, the ensuing “face-off” shall take place at one of the defending Team’s End Zone Face-off Spots. When a Goalkeeper deliberately removes their helmet and/or face mask to secure a stoppage of play, the Referee shall stop play as outlined above and assess the Goalkeeper a Minor Penalty for “Delay of Game”. If the Goalkeeper deliberately removes their helmet and/or face mask when the opposing Team is on a breakaway (where the cri- teria’s for a penalty shot is meet except for a foul from behind), or during the course of a “Penalty Shot” or shootout attempt, the Referee shall award a goal to the non-offending Team.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 12 – Illegal Equipment",
                            "Rule 51 – Roughing",
                            "Rule 63 – Delaying the Game"
                        ]
                    },
                    {
                        "page": 33,
                        "subrule_number": "9.7.",
                        "subrule_name": "FACIAL PROTECTION",
                        "rule_text": "There are three (3) permissible types of facial protection which can be attached to the front of a Skaters' helmet: a visor protection, a cage protection, or a full-face protection visor. All Players born after December 31, 1974, must wear, as a minimum a visor as a facial protection. The visor face protection must be properly affixed to their helmet, and must extend down in such a fashion as to ensure adequate eye protection, to cover the eyes and nose in its entirety. It must be fixed to the helmet along the sides so that it cannot be flipped up. A Player whose visor face protection becomes cracked or broken during game action must leave the ice immediately. Players are not allowed to wear a colored or tinted visor that would make it impossible to make eye contact with the player. Participating Teams in an IIHF Competition must ensure that their Players are equipped with a helmet manufactured and approved specifically for ice hockey and that, as applicable, a visor or a full-face protection is properly attached to it. Specific rules and guidelines for appropriate head / face / mouth protection for Women's Hockey and Men's Junior “Under 20” and “Under 18” categories.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 102 – Women’s Hockey Specific Equipment",
                            "Rule 202 – Men’s Junior Hockey Specific Equipment"
                        ]
                    },
                    {
                        "page": 34,
                        "subrule_number": "9.8.",
                        "subrule_name": "DANGEROUS EQUIPMENT",
                        "rule_text": "Equipment that does not conform to IIHF standards and equipment that is deemed unacceptable for the game action will be clas- sified as “Dangerous Equipment”. A Player using “Dangerous Equipment” will be sent off the ice by the Referee and their Team shall receive a warning from the Referee. After the Team has been warned, all Players on that Team wearing such equipment shall be penalized. Dangerous Equipment includes wearing a visor in a way that may cause injury to an opponent, wearing non-approved equipment, using dangerous or illegal skates or stick, failing to wear equipment under the uniform (except gloves, helmet, and goalkeeper’s pads), and cutting the palm out of one or both gloves. The use of pads or protectors made of metal, or of any other material likely to cause injury to an opposing Player is prohibited. Referees have the authority to prohibit any equipment they feel may cause injury to any participant in the game. Failure to comply with the Referees’ instructions shall result in a Minor Penalty for “Delay of Game”. A mask or protector of a design approved by the IIHF may be worn by a Player who has sustained a facial injury. In the first instance, the injured Player shall be entitled to wear any protective device prescribed by the Team Doctor. If any opposing Team objects to the device, it may record its objection with the IIHF. In cases where a stick may have been modified and it is evident that the edges have not been beveled, the Referee shall deem the stick to be dangerous equipment and removed from the game until the edges can be beveled sufficiently. No penalty is to be assessed unless the Player returns to the ice with the unmodified stick, in which case they will be assessed a Minor Penalty.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 12 – Illegal Equipment",
                            "Rule 63 – Delaying the Game"
                        ]
                    },
                    {
                        "page": 34,
                        "subrule_number": "9.9.",
                        "subrule_name": "SHIN PADS",
                        "rule_text": "Skaters’ shin pads must be of a size that allows them to fit inside standard Skaters’ socks. No protrusions from or additions to the manufactured shin pads are allowed.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 34,
                        "subrule_number": "9.10.",
                        "subrule_name": "SKATES",
                        "rule_text": "Skates must consist of only four parts: boot, blade, blade holder, and laces. The boot must conform to the foot of the Skater and not be unduly wide or long or have any attachments to it. The blade must be smooth from front to back and secured in the blade holder at all times. It cannot have a pick in the manner of figure skates. The front and back of the blade must be properly covered by the blade holder such that no part of either end protrudes. The blade must not extend in front of the toe or behind the heel of the boot in the manner of speed skates. No mechanical attachment or any other device which might help a Skater’s speed or ability to skate is allowed. Laces may be of any non-fluorescent color and tied in any manner, but they must not be so long that they touch the ice.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 35,
                        "subrule_number": "9.11.",
                        "subrule_name": "SKATES – GOALKEEPER",
                        "rule_text": "A Goalkeeper’s skates must have a non-fluorescent protective cowling at the front of each boot. The skate blade must be flat and cannot be longer than the boot. Any blades, projections, or “cheaters” added to the boot in order to give the Goalkeeper additional contact to the ice surface are not allowed.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 35,
                        "subrule_number": "9.12.",
                        "subrule_name": "NECK LACERATION PROTECTOR",
                        "rule_text": "For all players in all categories of IIHF Competition, it is mandatory to wear a neck laceration protector designed for this specific purpose, choosing a design that covers as much of the neck as possible. The Neck Laceration Protector must be properly worn and must not be modified or alternated in any way. For violation of this rule, after warning by the Referee, a Minor Penalty shall be imposed. A Goalkeeper may attach a throat protector to the chin of their facemask. It must be made of a material that will not cause injury.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 12 – Illegal Equipment",
                            "Rule 102.7 – Women’s Hockey Specific",
                            "Rule 202.7 – Men’s Junior Hockey Specific Equipment"
                        ]
                    },
                    {
                        "page": 35,
                        "subrule_number": "9.13.",
                        "subrule_name": "MOUTHGUARDS",
                        "rule_text": "The IIHF recommends that all Players wear a mouthguard, preferably of the custom-made variety. The mouthguard is designed to protect the teeth and jaws from impact and may also serve to reduce the risk of concussions. It is strongly recommended that Players use a custom-made mouthguard. It is recommended to wear this mouthguard in a com- pliant manner at all times when on the ice. Players who play in senior categories but are of the age as “Under 20” and “Under 18” categories must wear the appropriate protective equipment of these U20 and U18 categories in accordance with the specific rules. Specific rules and guidelines for appropriate head / face / neck / throat / mouth protection for Women's Hockey and Men's Junior “Under 20” and “Under 18” categories.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 102 – Women’s Hockey Specific Equipment",
                            "Rule 202 – Men’s Junior Hockey Specific Equipment"
                        ]
                    }
                ]
            },
            {
                "page": 35,
                "rule_number": 10,
                "rule_name": "STICKS",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 35,
                        "subrule_number": "10.1.",
                        "subrule_name": "PLAYER’S STICK",
                        "rule_text": "The sticks shall be made of wood or other material approved by the IIHF and must not have any projections. Adhesive, tape of any color may be wrapped around the stick at any place for the purpose of reinforcement or to improve control of the puck. The shaft of the stick, from the top down to the start of the blade, must be straight. No stick shall exceed 1.63 m in length from the heel to the end of the shaft nor more than 32.0 cm from the heel to the end of the blade. Requests for an exception to the length of the shaft (only) may be submitted in writing to and must be approved by the IIHF prior to any such stick being used. Only Players 2.0 m tall or more will be considered for exception. Maximum length of a stick granted an exception under this rule is 1.65 m. The butt end of the stick must be covered by a form of protection. If the cap at the top of a manufactured stick (i.e., metal or carbon) has been removed or falls off, the stick will be considered dangerous equipment. The blade of the stick shall not be more than 7.6 cm in width at any point between the heel and 1.5 cm in from the mid-point of the tip of the blade, nor less than 5.0 cm. All edges of the blade shall be beveled. The curvature of the blade of the stick shall be restricted in such a way that the distance of a perpendicular line measured from a straight line drawn from any point at the heel to the end of the blade to the point of maximum curvature shall not exceed 1.9 cm.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": [
                            "Rule 9.8 – Dangerous Equipment"
                        ]
                    },
                    {
                        "page": 36,
                        "subrule_number": "10.2.",
                        "subrule_name": "GOALKEEPER’S STICK",
                        "rule_text": "The sticks shall be made of wood or other material approved by the IIHF and must not have any projections. Adhesive tape of any color may be wrapped around the stick at any place for the purpose of reinforcement or to improve control of the puck. In the case of a Goalkeeper’s stick, there shall be a knob of white tape or other protective material approved by the IIHF. This knob must not be less than 1.3 cm thick at the top of the shaft. Failure to comply with this provision of the rule will result in the Goalkeeper’s stick being deemed unfit for play. The Goalkeeper’s stick must be changed without the assessment of a Minor Penalty. The shaft of the stick, from the top down to the start of the blade, must be straight. The blade of the Goalkeeper’s stick shall not exceed 9.0 cm in width at any point except at the heel, where it must not exceed 11.5 cm in width; nor shall the Goalkeeper’s stick exceed 39.5 cm in length from the heel to the end of the blade. The curvature of the blade of the stick shall be restricted in such a way that the distance of a perpendicular line measured from a straight line drawn from any point at the heel to the end of the blade to the point of maximum curvature shall not exceed 1.5 cm. The widened portion of the Goalkeeper’s stick extending up the shaft from the blade shall not extend more than 71 cm from the heel and shall not exceed 9.0 cm in width.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 36,
                        "subrule_number": "10.3.",
                        "subrule_name": "BROKEN STICK – PLAYER",
                        "rule_text": "A “broken stick” is one which, in the opinion of the Referee, is unfit for normal play. A Player without a stick may participate in the game. A Player whose stick is “broken” may participate in the game provided they drop the “broken stick”. A Minor Penalty shall be imposed for an infraction of this rule. A Player who has “lost” or has “broken their stick” may receive a replacement stick by having one handed to them from their own Players’ Bench, by having one handed to them by a Teammate on the ice or by picking up their own unbroken stick or that of a Teammate from the ice. A Player will be penalized if they throw, toss, slide or shoot a stick to a Teammate (Skater) on the ice, or if they pick up and play with an opponent’s stick. A Player may not participate in the play using a Goalkeeper’s stick. A Minor Penalty shall be imposed for an infraction of this rule. A Player using a stick thrown on the ice from the Players’ Bench or Penalty Box will not receive a penalty. However, the offending Team responsible for throwing the stick will receive a Bench Minor Penalty.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 37,
                        "subrule_number": "10.4.",
                        "subrule_name": "BROKEN STICK / ABANDONED STICK – GOALKEEPER",
                        "rule_text": "A Goalkeeper may continue to play with a “broken stick” until a stoppage of play or until they have one legally handed to them by a Teammate. A replacement stick for a “broken stick” cannot be thrown to a Goalkeeper on the ice surface. The stick must be passed from hand to hand to the Goalkeeper by a Teammate on the ice. For a violation of this rule, the offending Player shall receive a Minor Penalty for “throwing the stick”. An abandoned, intact stick accidentally dropped by the Goalkeeper may be passed from hand to hand to the Goalkeeper, or moved, pushed, or slid toward the Goalkeeper by a Teammate near the Goalkeeper on the ice as long as the moved stick does not interfere with play or cause a distraction to the game or opposing Players. If a Player causes interference with play or distraction to an oppo- sing Player by moving a lost stick, a Minor Penalty or “Penalty Shot” shall be imposed. The Goalkeeper shall not receive a penalty for receiving the stick. A Goalkeeper whose stick is “broken or illegal” may not go to the Players’ Bench for a replacement but must receive their stick from a Teammate as described above. A Goalkeeper may participate in the play using a Skater’s stick until such time as they are legally provided with a replacement Goalkeeper’s stick. For an infraction of this rule, a Minor Penalty shall be imposed on the Goalkeeper.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 53 – Throwing Equipment"
                        ]
                    },
                    {
                        "page": 37,
                        "subrule_number": "10.5.",
                        "subrule_name": "STICK MEASUREMENT",
                        "rule_text": "There is no limit to the number of stick-measurement requests a Team may make in a game, but a request for a stick measurement shall be limited to one request per Team during the course of any stoppage in play. When a formal complaint is made by the Captain or Alternate Captain of a Team, against the dimensions of an opponent’s stick, that opponent must be on the ice at the time the request is made to the Referee. It must be specified which part of the stick should be measured. Once the request is made, and as long as the On-ice Officials maintain visual contact with the stick, it can be measured. This means that if the Player whose stick is about to be measured steps off the ice onto their Players’ Bench, their stick may still be measured provided the request was received prior to them leaving the ice surface and the stick remains in the view of at least one of the On-ice Officials. The Referee shall take the stick to the Penalty Box where the necessary measurement shall be made immediately. Players on both Teams shall retire to their respective Players Benches. To measure the curvature of the blade of the stick, the Referee must draw an imaginary line along the outside of the shaft to the bottom of the blade and then along the bottom of the blade – this will determine the location of the heel. Using an IIHF-approved measuring gauge, the Referee shall secure the gauge at the heel of the stick and measure the curvature of the blade from the heel to any point along the toe of the blade. To measure any other dimension of the stick, the Referee shall use a measuring tape. The result shall be reported to the Penalty Timekeeper, who shall record it on the Penalty Record form. The Referee will convey the result of the measurement to the Captain or Alternate Captain of the Team whose stick was measured. A Player whose stick has been measured and it is found not to conform to the rule shall be assessed a Minor Penalty and the stick will be returned to the Players’ Bench by the Referee. If the complaint is not sustained, a Bench Minor Penalty shall be imposed against the complaining Team. A Player who participates in the play (i.e., checks or prevents the movement of an opponent or who plays the puck) while carrying two sticks (including while taking a replacement stick to their Goalkeeper) shall incur a Minor Penalty under this rule. A request for a stick measurement in regular playing time is permitted, including after the scoring of a goal. However, a goal cannot be disallowed as a result of the measurement. A request for a stick measurement following a goal in Overtime (including one scored on a “Penalty Shot” in Overtime) is not permit- ted. Stick measurements prior to or during the shootout are permitted, subject to the guidelines outlined in Any Player who deliberately breaks their stick or who refuses to surrender their stick for measurement when requested to do so by the Referee shall be assessed a Minor Penalty plus a ten-minute (10) Misconduct Penalty.",
                        "appendix_information": null,
                        "rule_reference": [
                            "Rule 10.7. – Stick Measurement – Prior to Shootout Attempt"
                        ]
                    },
                    {
                        "page": 38,
                        "subrule_number": "10.6.",
                        "subrule_name": "STICK MEASUREMENT – PRIOR TO “PENALTY SHOT”",
                        "rule_text": "A stick measurement request may be made prior to a “Penalty Shot” following these guidelines: If the stick is “legal” the complaining Team is assessed a Bench Minor Penalty, and a Player is placed in the Penalty Box immediately. Regardless of the result of the “Penalty Shot”, the Bench Minor Penalty is assessed and served. If the stick is “illegal” the Player will be assessed a Minor Penalty and must proceed to the Penalty Box immediately to serve their penalty. Another Player must take the “Penalty Shot”. If the Player refuses to surrender their stick for measurement, the “Penalty Shot” shall not be permitted, and the Player shall be assessed a Misconduct Penalty.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 38,
                        "subrule_number": "10.7.",
                        "subrule_name": "STICK MEASUREMENT – PRIOR TO SHOOTOUT ATTEMPT",
                        "rule_text": "This rule does not apply at IIHF Championships.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 38,
                        "subrule_number": "10.8.",
                        "subrule_name": "ILLEGAL STICK",
                        "rule_text": "An illegal stick is defined as one that, following a measurement, is deemed not conforming to Rule 10. An illegal stick is also defined as one when a player has not been legally handed one by his players’ bench or from a teammate. And finally, an illegal stick is anyti- me a player on the ice attempts to play the game with an opponent’s stick.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 38,
                "rule_number": 11,
                "rule_name": "GOALKEEPERS EQUIPMENT",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 38,
                        "subrule_number": "11.1.",
                        "subrule_name": "GOALKEEPER’S EQUIPMENT",
                        "rule_text": "With the exception of skates and stick, all the equipment worn by the Goalkeeper must be constructed solely for the purpose of protection, and they must not wear any garment or use any device which would give them undue assistance in keeping goal. The IIHF is specifically authorized to make a check of each Goalkeeper's equipment (including the sticks) to ensure the compliance with the rule. They shall report its findings to the Proper Authorities for proper disciplinary action.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 38,
                        "subrule_number": "11.2.",
                        "subrule_name": "LEG GUARDS",
                        "rule_text": "A piece of any material covering the space between the ice and the bottom of the Goalkeeper’s pads in front of the skates is not allowed. Graffiti-type designs, patterns, artwork, drawings, or slogans which are abusive or obscene and refer to culture, race, or religion are not allowed. The pads can be of any non-fluorescent colors. No attachments such as plastic puck foils are permitted to any part of the pads. The leg guards worn by Goalkeepers shall not exceed 28 cm in extreme width when on the leg of the Player.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 39,
                        "subrule_number": "11.3.",
                        "subrule_name": "CHEST AND ARM PADS",
                        "rule_text": "The chest and arm protector worn by each Goalkeeper must be anatomically proportional and size specific based on the individual physical characteristics of that Goalkeeper. No raised ridges are allowed on the front edges or sides of the chest pad, the inside or outside of the arms, or across the shoulders. Layering at the lateral edge of the torso is permitted to add rib protection, however, said thickness shall not exceed the thickness of the blocks on the front of the chest and provided further, that the flank protection must wrap around the contour of the Player’s torso. If, when the Goalkeeper assumes the normal crouch position, the shoulder or shoulder cap protection is pushed above the contour of the shoulder, the chest pad will be considered illegal. Any chest and arm protector deemed to be too large for a Goalkeeper by measurements taken by IIHF representatives shall be considered illegal equipment for that Goalkeeper, whether or not it would have fallen within previous equipment maximums.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 39,
                        "subrule_number": "11.4.",
                        "subrule_name": "PANTS",
                        "rule_text": "The pants worn by each Goalkeeper must be anatomically proportional and size-specific based on the individual physical characteristics of that Goalkeeper. No internal or external padding is permitted on the pant leg or waist beyond that which is required to provide protection (i.e., no ridges, inside or out). If the Goalkeeper is wearing their pants shells loosely, allowing them to close the open space between their legs above their pads when they are in the crouch position, the shells will be considered illegal. Thigh protectors inside the pants must follow the contour of the leg. Flat thigh protectors are not allowed. Any pant deemed by the IIHF representatives to be non-compliant with this rule will be considered illegal equipment for that Goalkeeper, regardless of whether or not it would have fallen within previous equipment maximums. Any alteration request must be filed with an application to the IIHF before any modifications or additions are made.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 39,
                        "subrule_number": "11.5.",
                        "subrule_name": "KNEE PADS",
                        "rule_text": "Knee protection must be strapped and must fit under the thigh pad of the pants. Flaps attached to the inside of the Goalkeeper’s pads above the knee that are not worn under the thigh pad of the pants are not allowed. The knee-strap pad is the pad that separates the inside of the knee from the ice. The knee protection must be worn with the strap tight so that it does not obscure any portion of area between the legs, or the “five hole.” The padding between the knee strap pad and the inner knee channel is not affected by this measurement standard. Medial rolls (raised seam ridges) are not allowed.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 40,
                        "subrule_number": "11.6.",
                        "subrule_name": "CATCHING GLOVE",
                        "rule_text": "A maximum perimeter of 114.5 cm is permitted. The perimeter of the glove is the distance around the glove. The wrist cuff must be 10.5 cm in width. The cuff of the glove is considered to be the portion of the glove protecting the wrist from the point where the thumb joint meets the wrist. Any protection joining/enhancing the cuff to the glove will be considered part of the glove rather than the cuff. The wrist cuff is to be a maximum of 20.5 cm in length (this includes the bindings). All measurements follow the contour of the cuff. The distance from the heel of the glove along the pocket and following the contour of the inside of the trap of the glove to the top of the “T” trap must not exceed 46.0 cm. The heel is considered to be the point at which the straight vertical line from the cuff meets the glove.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 40,
                        "subrule_number": "11.7.",
                        "subrule_name": "BLOCKING GLOVE",
                        "rule_text": "The blocking glove must be rectangular. The flap protecting the thumb and wrist must be fastened to the blocker and follow the contour of the thumb and wrist. Raised ridges are not allowed on any portion of the blocking glove. Protective padding attached to the back or forming part of the Goalkeeper's blocking glove shall not exceed 20.5 cm in width nor more than 38.5 cm in length at any point (this includes the bindings). All measurements follow the contour of the back of the glove. The thumb protection must not exceed 18.0 cm in extreme length when measured from the top of the blocking surface.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 40,
                        "subrule_number": "11.8.",
                        "subrule_name": "FACE MASKS",
                        "rule_text": "Goalkeepers must wear their face mask at all times during game action. Protective face masks of a design approved by the IIHF must be worn by Goalkeepers. A face mask deemed to be worn only to increase stopping area will be considered illegal. The face mask must be constructed in such a way that a puck cannot penetrate the openings. Goalkeepers are allowed to wear a facemask of a different color and design than that of their Teammates. The backup Goalkeeper is not required to wear their face mask when they cross the ice to return to the Players’ Bench after intermission. Specific rules and guidelines for appropriate head / face protection for Women's Hockey and Men's Junior “Under 20” and “Under 18” categories.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": [
                            "Rule 102 – Women’s Hockey Specific Equipment",
                            "Rule 202 – Men’s Junior Hockey Specific Equipment"
                        ]
                    },
                    {
                        "page": 40,
                        "subrule_number": "11.9.",
                        "subrule_name": "INSPECTIONS BY THE IIHF",
                        "rule_text": "Goalkeepers are not allowed to participate in the game with equipment that does not comply with the rules. Inspections by the IIHF can take place at any time, before, during, or after any game. IIHF representatives may obtain equipment from any or all participating Goalkeeper(s). This equipment may be removed to a secure location for measuring. Inspections will be logged, and a fair play agreement will be signed by the appropriate Goalkeepers and Team Equipment Managers. Non-complaint and illegal equipment must be corrected before participation in a game or further use in it. If further irregularities are found during follow-up checks, the incident will be reported to the Proper Authorities. Refusal to submit the equipment for IIHF measurement will result in the same sanctions as those imposed on a Goalkeeper with illegal equipment.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 41,
                "rule_number": 12,
                "rule_name": "ILLEGAL EQUIPMENT",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 41,
                        "subrule_number": "12.1.",
                        "subrule_name": "ILLEGAL EQUIPMENT",
                        "rule_text": "All protective equipment, except gloves, headgear, mouthguards, neck laceration protection and Goalkeepers’ leg guards must be worn under the uniform. For violation of this rule, after warning by the Referee, a Minor Penalty shall be imposed. Players violating this rule shall not be permitted to participate in the game until such equipment has been corrected or removed. If the Player refuses, they shall be assessed a Minor Penalty for “Illegal Equipment” and if they return to the ice without making the change, they shall be issued a Misconduct Penalty. Should this happen a third time, the Player shall be issued a Game Misconduct Penalty.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 41,
                        "subrule_number": "12.2.",
                        "subrule_name": "GLOVES",
                        "rule_text": "A glove from which all or part of the palm has been removed or cut to permit the use of the bare hand shall be considered illegal equipment and if any Player wears such a glove in play, a Minor Penalty shall be imposed on them. When a complaint is made under this rule, and such complaint is not sustained, a Bench-minor Penalty shall be imposed against the complaining Team for delaying the game.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 41,
                        "subrule_number": "12.3.",
                        "subrule_name": "ELBOW PADS",
                        "rule_text": "All elbow pads which do not have a soft protective outer covering of sponge rubber or similar material at least 1.5 cm thick shall be considered dangerous equipment.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 41,
                        "subrule_number": "12.4.",
                        "subrule_name": "FAIR PLAY",
                        "rule_text": "These equipment regulations (Section 3) are written in the spirit of “Fair Play”. If at any time the IIHF feels that this spirit is being abused, the offending equipment will be deemed ineligible for play until a hearing has ruled on its eligibility.",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 41,
                        "subrule_number": "12.5.",
                        "subrule_name": "INSPECTIONS BY THE IIHF",
                        "rule_text": "Inspections by the IIHF can take place at any time, before, during, or after any game. IIHF representatives may obtain equipment from any Players of the participating Teams. Complained and illegal equipment must be corrected before participation in a game. If further irregularities are found during follow-up checks, the incident will be reported to the Proper Authorities. Refusal to submit the equipment for IIHF measurement will result in the same sanctions as those imposed on a Player with illegal equipment.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 41,
                "rule_number": 13,
                "rule_name": "PUCK",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 41,
                        "subrule_number": "13.1.",
                        "subrule_name": "DIMENSIONS",
                        "rule_text": "The puck shall be made of vulcanized rubber, or other approved material, 2.5 cm thick and 7.6 cm in diameter and shall weigh between 156 g and 170 g. All pucks used in competition must be approved by the IIHF. A printed logo, trademark, and advertising on the puck must not exceed 4.5 cm in diameter of the area of each side of a puck or 35 % of the area of each side of the puck. There may be printing on both sides of the puck.",
                        "appendix_information": [
                            "III – Ice Hockey Equipment"
                        ],
                        "rule_reference": null
                    },
                    {
                        "page": 42,
                        "subrule_number": "13.2.",
                        "subrule_name": "SUPPLY",
                        "rule_text": "The Organizing Committee or the Home Team shall be responsible for providing an adequate supply of official pucks which shall be kept in a frozen condition. This supply of pucks shall be kept at the Penalty Box under the control of one of the regular Off-Ice Officials or a special attendant. Frozen Puck Regulations:",
                        "appendix_information": null,
                        "rule_reference": null
                    },
                    {
                        "page": 42,
                        "subrule_number": "13.3.",
                        "subrule_name": "ILLEGAL PUCK",
                        "rule_text": "If at any time while play is in progress, a puck other than the one legally in play shall appear on the playing surface, the play shall not be stopped but shall continue with the legal puck until the play then in progress is completed by change of possession.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            },
            {
                "page": 42,
                "rule_number": 14,
                "rule_name": "ADJUSTMENT TO CLOTHING OR EQUIPMENT",
                "rule_text": null,
                "subrules": [
                    {
                        "page": 42,
                        "subrule_number": "14.1.",
                        "subrule_name": "ADJUSTMENT TO CLOTHING OR EQUIPMENT",
                        "rule_text": "Play shall not be stopped, nor the game delayed by reasons of adjustments to clothing, equipment, skates or sticks. The responsibility of maintaining clothing and equipment in proper condition shall be upon the Player. If adjustments are required, the Player shall leave the ice and play shall continue with a substitute. No delay shall be permitted for the repair or adjustment of Goalkeeper’s equipment. If adjustments are required, the Goalkeeper shall leave the ice and their place shall be taken by the substitute Goalkeeper immediately.",
                        "appendix_information": null,
                        "rule_reference": null
                    }
                ]
            }
        ]
    }
]